{
  "texts" : {
    "part1" : [
      ["DATA SCIENCE", "Data science is the study of data to extract meaningful insights for business. It is a multidisciplinary approach that combines principles and practices from the fields of mathematics, statistics, artificial intelligence, and computer engineering to analyze large amounts of data. This analysis helps data scientists to ask and answer questions like what happened, why it happened, what will happen, and what can be done with the results."]
    ],
    "part2" : [
      ["WHAT IS DATA SCIENCE USED FOR ?", "" ],
      ["Descriptive analysis", "Descriptive analysis examines data to gain insights into what happened or what is happening in the data environment. It is characterized by data visualizations such as pie charts, bar charts, line graphs, tables, or generated narratives. For example, a flight booking service may record data like the number of tickets booked each day. Descriptive analysis will reveal booking spikes, booking slumps, and high-performing months for this service."],
      ["Diagnostic analysis", "Diagnostic analysis is a deep-dive or detailed data examination to understand why something happened. It is characterized by techniques such as drill-down, data discovery, data mining, and correlations. Multiple data operations and transformations may be performed on a given data set to discover unique patterns in each of these techniques.For example, the flight service might drill down on a particularly high-performing month to better understand the booking spike. This may lead to the discovery that many customers visit a particular city to attend a monthly sporting event."],
      ["Predictive analysis", "Predictive analysis uses historical data to make accurate forecasts about data patterns that may occur in the future. It is characterized by techniques such as machine learning, forecasting, pattern matching, and predictive modeling. In each of these techniques, computers are trained to reverse engineer causality connections in the data.For example, the flight service team might use data science to predict flight booking patterns for the coming year at the start of each year. The computer program or algorithm may look at past data and predict booking spikes for certain destinations in May. Having anticipated their customer's future travel requirements, the company could start targeted advertising for those cities from February."],
      ["Prescriptive analysis", "Prescriptive analytics takes predictive data to the next level. It not only predicts what is likely to happen but also suggests an optimum response to that outcome. It can analyze the potential implications of different choices and recommend the best course of action. It uses graph analysis, simulation, complex event processing, neural networks, and recommendation engines from machine learning. Back to the flight booking example, prescriptive analysis could look at historical marketing campaigns to maximize the advantage of the upcoming booking spike. A data scientist could project booking outcomes for different levels of marketing spend on various marketing channels. These data forecasts would give the flight booking company greater confidence in their marketing decisions."]
    ],
    "part3" : [
      ["WHAT IS MACHINE LEARNING ?", "Machine learning (ML) is a branch of artificial intelligence (AI) and computer science that focuses on the using data and algorithms to enable AI to imitate the way that humans learn, gradually improving its accuracy."],
      ["How does machine learning work?", "UC Berkeley breaks out the learning system of a machine learning algorithm into three main parts."],
      ["A Decision Process", "In general, machine learning algorithms are used to make a prediction or classification. Based on some input data, which can be labeled or unlabeled, your algorithm will produce an estimate about a pattern in the data."],
      ["An Error Function", "An error function evaluates the prediction of the model. If there are known examples, an error function can make a comparison to assess the accuracy of the model."],
      ["A Model Optimization Process", "If the model can fit better to the data points in the training set, then weights are adjusted to reduce the discrepancy between the known example and the model estimate. The algorithm will repeat this iterative “evaluate and optimize” process, updating weights autonomously until a threshold of accuracy has been met. "]
    ],
    "part4" : [
      ["MACHINE LEARNING METHODS", "" ],
      ["Supervised machine learning","Supervised learning, also known as supervised machine learning, is defined by its use of labeled datasets to train algorithms to classify data or predict outcomes accurately. As input data is fed into the model, the model adjusts its weights until it has been fitted appropriately. This occurs as part of the cross validation process to ensure that the model avoids overfitting or underfitting. Supervised learning helps organizations solve a variety of real-world problems at scale, such as classifying spam in a separate folder from your inbox. Some methods used in supervised learning include neural networks, naïve bayes, linear regression, logistic regression, random forest, and support vector machine (SVM)."],
      ["Unsupervised machine learning","Unsupervised learning, also known as unsupervised machine learning, uses machine learning algorithms to analyze and cluster unlabeled datasets (subsets called clusters). These algorithms discover hidden patterns or data groupings without the need for human intervention. This method's ability to discover similarities and differences in information make it ideal for exploratory data analysis, cross-selling strategies, customer segmentation, and image and pattern recognition. It's also used to reduce the number of features in a model through the process of dimensionality reduction. Principal component analysis (PCA) and singular value decomposition (SVD) are two common approaches for this. Other algorithms used in unsupervised learning include neural networks, k-means clustering, and probabilistic clustering methods."],
      ["Semi-supervised learning ","Semi-supervised learning offers a happy medium between supervised and unsupervised learning. During training, it uses a smaller labeled data set to guide classification and feature extraction from a larger, unlabeled data set. Semi-supervised learning can solve the problem of not having enough labeled data for a supervised learning algorithm. It also helps if it's too costly to label enough data."]
    ],
    "part5" : [
      ["COMMON MACHINE LEARNING ALGORITHMS:", "" ],
      ["Neural networks", "Neural networks simulate the way the human brain works, with a huge number of linked processing nodes. Neural networks are good at recognizing patterns and play an important role in applications including natural language translation, image recognition, speech recognition, and image creation."],
      ["Linear regression", "This algorithm is used to predict numerical values, based on a linear relationship between different values. For example, the technique could be used to predict house prices based on historical data for the area."],
      ["Logistic regression", "This supervised learning algorithm makes predictions for categorical response variables, such as “yes/no” answers to questions. It can be used for applications such as classifying spam and quality control on a production line."],
      ["Clustering", "Using unsupervised learning, clustering algorithms can identify patterns in data so that it can be grouped. Computers can help data scientists by identifying differences between data items that humans have overlooked."],
      ["Decision trees", "Decision trees can be used for both predicting numerical values (regression) and classifying data into categories. Decision trees use a branching sequence of linked decisions that can be represented with a tree diagram. One of the advantages of decision trees is that they are easy to validate and audit, unlike the black box of the neural network."],
      ["Random forests", "In a random forest, the machine learning algorithm predicts a value or category by combining the results from a number of decision trees."]
    ],
    "part6" : [
      ["Measuring Model Accuracy", "" ],
      ["HOW DO WE MEASURE ACCURACY OF ML AND NLP MODELS:", "Accuracy is mainly used in classification problems to get the appropriate percentage of the models being executed to know how much of it is correctly predicted. In any model, there will be several classification problems will present when we execute them, then the accuracy plays the main role by talking about whether all the problems are correctly predicted or not with respect to the total number of predictions made by the model. We can calculate the accuracy of any model by dividing the correctly predicted problems by the total number of predictions made."],
      ["Accuracy in Binary Classification:", "In the binary classification case, we can communicate precision in True/False Positive/Negative qualities. The accuracy recipe in Machine learning is given as follows:"]
    ],
    "part7" : [
      ["How to Check the Accuracy of your Machine Learning Model", "" ],
      ["In the accuracy classes, there are only two classes present.","They are positive/negative"],
      ["TP", "TP stands for True positive, i.e., These are the classes that are correctly predicted, and the correctly predicted classes are marked as positive."],
      ["FP", "FP stands for false positive, i.e., These are the classes that are falsely predicted, and the falsely predicted classes are marked as positive."],
      ["TN", "TN stands for True positive, i.e., These are the classes that are correctly predicted, and the correctly predicted classes are marked as negative."],
      ["FN", "FN stands for False negative, i.e., These are the classes that are falsely predicted, and the falsely predicted classes are marked as negative."]
    ]
  }
}